0x01-challenge/blog/app/controllers/posts_controller.rb

  def index
    @posts = Post.where(:online => true).all.order('created_at DESC')
---
SELECT "posts".* FROM "posts" WHERE "posts"."online" = ? ORDER BY created_at DESC  [["online", "t"]]

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)